Autodesk.Revit.DB.GroupType.LoadFrom(System.String,Autodesk.Revit.DB.GroupLoadOptions)
Replaces the group with the contents of the input file.
fileName:
The file to be used for the replacment.
options:
Group load options.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid RVT file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given fileName does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this GroupType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this GroupType" does not belong to a project document.
-or-
The GroupType is not a Model group type and can't be reloaded.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this GroupType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this GroupType is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this GroupType has no open transaction.
Since:
2024